const homeText = [
    {
        textTitle:"Захопіться різними готелями в Україні",
        titleText: "Готель - це приміщення, яке пропонує комфортабельне проживання для гостей. Незалежно від того, чи ви подорожуєте в Львів, Київ, чи Одесу, в Україні є багато чудових готелів для вибору. Україна славиться своєю гостьминою та різноманітністю готельних послуг. Незалежно від того, чи ви шукаєте розкішний відпочинок у історичних містах, або спокійну відпустку на березі моря, ви знайдете ідеальний готель, що відповідає вашим потребам.\n" +

        "У Львові ви зможете насолодитися атмосферою старовинного міста та обрати готель, розташований в самому центрі історичного Львова. Культурні пам'ятки, затишні кав'ярні та вуличні фестивалі створять незабутню атмосферу для вашої подорожі.\n" +
        
        "Київ, столиця України, пропонує розмаїтість готельних пропозицій від сучасних високих хмарочосів до історичних готелів на вулицях, що містять тисячолітню історію. Ви зможете досліджувати багатий культурний спадок та смачну українську кухню.\n" +
        
        "Одеса, розташована на березі Чорного моря, має величезний вибір готелів з видом на море та легкий доступ до пляжів. Проведіть романтичні вечори на набережній та насолоджуйтеся свіжими морськими продуктами в місцевих ресторанах.\n" +
        
        " Незалежно від вашого вибору, готелі в Україні готові зустріти вас з відкритими руками і надати незабутні враження від вашої подорожі."
    }
];

export default homeText;