import React from "react";
import HotelPicture from "../../components/Icons/main.jpg";
import Image1 from "../../components/Icons/hotel_lviv.jpg";
import Image2 from "../../components/Icons/hotel_ukraine.jpg";
import Image3 from "../../components/Icons/hotel_chornomorets.jpg";
import {
    SectionWrapper,
    StyledText,
    StyledButton,
    CardWrapper,
} from "./Home.styled";
import CardItem from "../../components/CardElement/CardItem";

const dataCard = [
    {
        title: "Готель Львів",
        text: "Готель Львів - це чудове місце для відпочинку в самому серці Львова. Наш готель пропонує комфортабельні номери та вишукані страви в ресторані.",
        image: Image1,
        price: 800,
    },
    {
        title: "Готель Україна",
        text: "Готель Україна розташований в центрі Львова і пропонує розкішні номери та вишукані послуги для гостей. Відмінне місце для відпочинку.",
        image: Image2,
        price: 1500,
    },
    {
        title: "Готель Чорноморець",
        text: "Готель Чорноморець - це чудове місце для проживання в Одесі. Наш готель недалеко від моря та пропонує комфортабельні номери та вид на море.",
        image: Image3,
        price: 1000,
    },
];

const Home = () => {
    return (
        <div>
            <SectionWrapper>
                <img src={HotelPicture} alt="#" className="main_photo"/>
                <StyledText>
                    <h1>Захопіться різними готелями в Україні</h1>
                    <p>
                    Готель - це приміщення, яке пропонує комфортабельне проживання для гостей. Незалежно від того, чи ви подорожуєте в Львів, Київ, чи Одесу, в Україні є багато чудових готелів для вибору. Україна славиться своєю гостьминою та різноманітністю готельних послуг. Незалежно від того, чи ви шукаєте розкішний відпочинок у історичних містах, або спокійну відпустку на березі моря, ви знайдете ідеальний готель, що відповідає вашим потребам.

                    У Львові ви зможете насолодитися атмосферою старовинного міста та обрати готель, розташований в самому центрі історичного Львова. Культурні пам'ятки, затишні кав'ярні та вуличні фестивалі створять незабутню атмосферу для вашої подорожі.

                    Київ, столиця України, пропонує розмаїтість готельних пропозицій від сучасних високих хмарочосів до історичних готелів на вулицях, що містять тисячолітню історію. Ви зможете досліджувати багатий культурний спадок та смачну українську кухню.

                    Одеса, розташована на березі Чорного моря, має величезний вибір готелів з видом на море та легкий доступ до пляжів. Проведіть романтичні вечори на набережній та насолоджуйтеся свіжими морськими продуктами в місцевих ресторанах.

                    Незалежно від вашого вибору, готелі в Україні готові зустріти вас з відкритими руками і надати незабутні враження від вашої подорожі.

                    </p>
                </StyledText>
            </SectionWrapper>
            <CardWrapper>
                {dataCard.map(({ title, text, image, price }, idx) => (
                    <CardItem
                        title={title}
                        text={text}
                        imageSrc={image}
                        price={price}
                        id={idx}
                    />
                ))}
            </CardWrapper>
            <StyledButton size="large">Показати більше</StyledButton>
        </div>
    );
};

export default Home;